---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Length
zh: 长度
source: html/6ed4c1fd-b680-dc3a-1764-d95819ba5f0e.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Length Property

**中文**: 长度

The length of the duct. Units: (ft).

## Syntax (C#)
```csharp
public double Length { get; }
```